grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
#pragma once 

/* --- OTG_FS_HOST: USB on the go high speed ------------------------ */

/** @defgroup otg_fs_host_registers USB on the go high speed Register
@{*/

/** OTG_FS_HOST_OTG_HS_HCFG OTG_HS host configuration register **/
#define OTG_FS_HOST_OTG_HS_HCFG			MMIO32(OTG_FS_HOST_BASE + 0x00)
/** OTG_FS_HOST_OTG_HS_HFIR OTG_HS Host frame interval register **/
#define OTG_FS_HOST_OTG_HS_HFIR			MMIO32(OTG_FS_HOST_BASE + 0x04)
/** OTG_FS_HOST_OTG_HS_HFNUM OTG_HS host frame number/frame time remaining register **/
#define OTG_FS_HOST_OTG_HS_HFNUM			MMIO32(OTG_FS_HOST_BASE + 0x08)
/** OTG_FS_HOST_OTG_HS_HPTXSTS OTG_HS_Host periodic transmit FIFO/queue status register **/
#define OTG_FS_HOST_OTG_HS_HPTXSTS			MMIO32(OTG_FS_HOST_BASE + 0x10)
/** OTG_FS_HOST_OTG_HS_HAINT OTG_HS Host all channels interrupt register **/
#define OTG_FS_HOST_OTG_HS_HAINT			MMIO32(OTG_FS_HOST_BASE + 0x14)
/** OTG_FS_HOST_OTG_HS_HAINTMSK OTG_HS host all channels interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HAINTMSK			MMIO32(OTG_FS_HOST_BASE + 0x18)
/** OTG_FS_HOST_OTG_HS_HPRT OTG_HS host port control and status register **/
#define OTG_FS_HOST_OTG_HS_HPRT			MMIO32(OTG_FS_HOST_BASE + 0x40)
/** OTG_FS_HOST_OTG_HS_HCCHAR0 OTG_HS host channel-0 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR0			MMIO32(OTG_FS_HOST_BASE + 0x100)
/** OTG_FS_HOST_OTG_HS_HCSPLT0 OTG_HS host channel-0 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT0			MMIO32(OTG_FS_HOST_BASE + 0x104)
/** OTG_FS_HOST_OTG_HS_HCINT0 OTG_HS host channel-11 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT0			MMIO32(OTG_FS_HOST_BASE + 0x108)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0 OTG_HS host channel-11 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0			MMIO32(OTG_FS_HOST_BASE + 0x10c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ0 OTG_HS host channel-11 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ0			MMIO32(OTG_FS_HOST_BASE + 0x110)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG0 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG0			MMIO32(OTG_FS_HOST_BASE + 0x110)
/** OTG_FS_HOST_OTG_HS_HCDMA0 OTG_HS host channel-0 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA0			MMIO32(OTG_FS_HOST_BASE + 0x114)
/** OTG_FS_HOST_OTG_HS_HCDMASG0 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG0			MMIO32(OTG_FS_HOST_BASE + 0x114)
/** OTG_FS_HOST_OTG_HS_HCCHAR1 OTG_HS host channel-1 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR1			MMIO32(OTG_FS_HOST_BASE + 0x120)
/** OTG_FS_HOST_OTG_HS_HCSPLT1 OTG_HS host channel-1 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT1			MMIO32(OTG_FS_HOST_BASE + 0x124)
/** OTG_FS_HOST_OTG_HS_HCINT1 OTG_HS host channel-1 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT1			MMIO32(OTG_FS_HOST_BASE + 0x128)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1 OTG_HS host channel-1 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1			MMIO32(OTG_FS_HOST_BASE + 0x12c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ1 OTG_HS host channel-1 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ1			MMIO32(OTG_FS_HOST_BASE + 0x130)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG1 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG1			MMIO32(OTG_FS_HOST_BASE + 0x130)
/** OTG_FS_HOST_OTG_HS_HCDMA1 OTG_HS host channel-1 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA1			MMIO32(OTG_FS_HOST_BASE + 0x134)
/** OTG_FS_HOST_OTG_HS_HCDMASG1 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG1			MMIO32(OTG_FS_HOST_BASE + 0x134)
/** OTG_FS_HOST_OTG_HS_HCCHAR2 OTG_HS host channel-2 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR2			MMIO32(OTG_FS_HOST_BASE + 0x140)
/** OTG_FS_HOST_OTG_HS_HCSPLT2 OTG_HS host channel-2 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT2			MMIO32(OTG_FS_HOST_BASE + 0x144)
/** OTG_FS_HOST_OTG_HS_HCINT2 OTG_HS host channel-2 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT2			MMIO32(OTG_FS_HOST_BASE + 0x148)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2 OTG_HS host channel-2 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2			MMIO32(OTG_FS_HOST_BASE + 0x14c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ2 OTG_HS host channel-2 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ2			MMIO32(OTG_FS_HOST_BASE + 0x150)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG2 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG2			MMIO32(OTG_FS_HOST_BASE + 0x150)
/** OTG_FS_HOST_OTG_HS_HCDMA2 OTG_HS host channel-2 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA2			MMIO32(OTG_FS_HOST_BASE + 0x154)
/** OTG_FS_HOST_OTG_HS_HCDMASG2 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG2			MMIO32(OTG_FS_HOST_BASE + 0x154)
/** OTG_FS_HOST_OTG_HS_HCCHAR3 OTG_HS host channel-3 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR3			MMIO32(OTG_FS_HOST_BASE + 0x160)
/** OTG_FS_HOST_OTG_HS_HCSPLT3 OTG_HS host channel-3 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT3			MMIO32(OTG_FS_HOST_BASE + 0x164)
/** OTG_FS_HOST_OTG_HS_HCINT3 OTG_HS host channel-3 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT3			MMIO32(OTG_FS_HOST_BASE + 0x168)
/** OTG_FS_HOST_OTG_HS_HCINTMSK3 OTG_HS host channel-3 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK3			MMIO32(OTG_FS_HOST_BASE + 0x16c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ3 OTG_HS host channel-3 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ3			MMIO32(OTG_FS_HOST_BASE + 0x170)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG3 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG3			MMIO32(OTG_FS_HOST_BASE + 0x170)
/** OTG_FS_HOST_OTG_HS_HCDMA3 OTG_HS host channel-3 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA3			MMIO32(OTG_FS_HOST_BASE + 0x174)
/** OTG_FS_HOST_OTG_HS_HCDMASG3 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG3			MMIO32(OTG_FS_HOST_BASE + 0x174)
/** OTG_FS_HOST_OTG_HS_HCCHAR4 OTG_HS host channel-4 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR4			MMIO32(OTG_FS_HOST_BASE + 0x180)
/** OTG_FS_HOST_OTG_HS_HCSPLT4 OTG_HS host channel-4 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT4			MMIO32(OTG_FS_HOST_BASE + 0x184)
/** OTG_FS_HOST_OTG_HS_HCINT4 OTG_HS host channel-4 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT4			MMIO32(OTG_FS_HOST_BASE + 0x188)
/** OTG_FS_HOST_OTG_HS_HCINTMSK4 OTG_HS host channel-4 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK4			MMIO32(OTG_FS_HOST_BASE + 0x18c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ4 OTG_HS host channel-4 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ4			MMIO32(OTG_FS_HOST_BASE + 0x190)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG4 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG4			MMIO32(OTG_FS_HOST_BASE + 0x190)
/** OTG_FS_HOST_OTG_HS_HCDMA4 OTG_HS host channel-4 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA4			MMIO32(OTG_FS_HOST_BASE + 0x194)
/** OTG_FS_HOST_OTG_HS_HCDMASG4 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG4			MMIO32(OTG_FS_HOST_BASE + 0x194)
/** OTG_FS_HOST_OTG_HS_HCCHAR5 OTG_HS host channel-5 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR5			MMIO32(OTG_FS_HOST_BASE + 0x1a0)
/** OTG_FS_HOST_OTG_HS_HCSPLT5 OTG_HS host channel-5 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT5			MMIO32(OTG_FS_HOST_BASE + 0x1a4)
/** OTG_FS_HOST_OTG_HS_HCINT5 OTG_HS host channel-5 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT5			MMIO32(OTG_FS_HOST_BASE + 0x1a8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK5 OTG_HS host channel-5 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK5			MMIO32(OTG_FS_HOST_BASE + 0x1ac)
/** OTG_FS_HOST_OTG_HS_HCTSIZ5 OTG_HS host channel-5 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ5			MMIO32(OTG_FS_HOST_BASE + 0x1b0)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG5 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG5			MMIO32(OTG_FS_HOST_BASE + 0x1b0)
/** OTG_FS_HOST_OTG_HS_HCDMA5 OTG_HS host channel-5 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA5			MMIO32(OTG_FS_HOST_BASE + 0x1b4)
/** OTG_FS_HOST_OTG_HS_HCDMASG5 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG5			MMIO32(OTG_FS_HOST_BASE + 0x1b4)
/** OTG_FS_HOST_OTG_HS_HCCHAR6 OTG_HS host channel-6 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR6			MMIO32(OTG_FS_HOST_BASE + 0x1c0)
/** OTG_FS_HOST_OTG_HS_HCSPLT6 OTG_HS host channel-6 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT6			MMIO32(OTG_FS_HOST_BASE + 0x1c4)
/** OTG_FS_HOST_OTG_HS_HCINT6 OTG_HS host channel-6 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT6			MMIO32(OTG_FS_HOST_BASE + 0x1c8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6 OTG_HS host channel-6 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6			MMIO32(OTG_FS_HOST_BASE + 0x1cc)
/** OTG_FS_HOST_OTG_HS_HCTSIZ6 OTG_HS host channel-6 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ6			MMIO32(OTG_FS_HOST_BASE + 0x1d0)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG6 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG6			MMIO32(OTG_FS_HOST_BASE + 0x1d0)
/** OTG_FS_HOST_OTG_HS_HCDMA6 OTG_HS host channel-6 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA6			MMIO32(OTG_FS_HOST_BASE + 0x1d4)
/** OTG_FS_HOST_OTG_HS_HCDMASG6 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG6			MMIO32(OTG_FS_HOST_BASE + 0x1d4)
/** OTG_FS_HOST_OTG_HS_HCCHAR7 OTG_HS host channel-7 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR7			MMIO32(OTG_FS_HOST_BASE + 0x1e0)
/** OTG_FS_HOST_OTG_HS_HCSPLT7 OTG_HS host channel-7 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT7			MMIO32(OTG_FS_HOST_BASE + 0x1e4)
/** OTG_FS_HOST_OTG_HS_HCINT7 OTG_HS host channel-7 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT7			MMIO32(OTG_FS_HOST_BASE + 0x1e8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK7 OTG_HS host channel-7 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK7			MMIO32(OTG_FS_HOST_BASE + 0x1ec)
/** OTG_FS_HOST_OTG_HS_HCTSIZ7 OTG_HS host channel-7 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ7			MMIO32(OTG_FS_HOST_BASE + 0x1f0)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG7 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG7			MMIO32(OTG_FS_HOST_BASE + 0x1f0)
/** OTG_FS_HOST_OTG_HS_HCDMA7 OTG_HS host channel-7 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA7			MMIO32(OTG_FS_HOST_BASE + 0x1f4)
/** OTG_FS_HOST_OTG_HS_HCDMASG7 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG7			MMIO32(OTG_FS_HOST_BASE + 0x1f4)
/** OTG_FS_HOST_OTG_HS_HCCHAR8 OTG_HS host channel-8 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR8			MMIO32(OTG_FS_HOST_BASE + 0x200)
/** OTG_FS_HOST_OTG_HS_HCSPLT8 OTG_HS host channel-8 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT8			MMIO32(OTG_FS_HOST_BASE + 0x204)
/** OTG_FS_HOST_OTG_HS_HCINT8 OTG_HS host channel-8 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT8			MMIO32(OTG_FS_HOST_BASE + 0x208)
/** OTG_FS_HOST_OTG_HS_HCINTMSK8 OTG_HS host channel-8 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK8			MMIO32(OTG_FS_HOST_BASE + 0x20c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ8 OTG_HS host channel-8 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ8			MMIO32(OTG_FS_HOST_BASE + 0x210)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG8 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG8			MMIO32(OTG_FS_HOST_BASE + 0x210)
/** OTG_FS_HOST_OTG_HS_HCDMA8 OTG_HS host channel-8 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA8			MMIO32(OTG_FS_HOST_BASE + 0x214)
/** OTG_FS_HOST_OTG_HS_HCDMASG8 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG8			MMIO32(OTG_FS_HOST_BASE + 0x214)
/** OTG_FS_HOST_OTG_HS_HCCHAR9 OTG_HS host channel-9 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR9			MMIO32(OTG_FS_HOST_BASE + 0x220)
/** OTG_FS_HOST_OTG_HS_HCSPLT9 OTG_HS host channel-9 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT9			MMIO32(OTG_FS_HOST_BASE + 0x224)
/** OTG_FS_HOST_OTG_HS_HCINT9 OTG_HS host channel-9 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT9			MMIO32(OTG_FS_HOST_BASE + 0x228)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9 OTG_HS host channel-9 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9			MMIO32(OTG_FS_HOST_BASE + 0x22c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ9 OTG_HS host channel-9 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ9			MMIO32(OTG_FS_HOST_BASE + 0x230)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG9 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG9			MMIO32(OTG_FS_HOST_BASE + 0x230)
/** OTG_FS_HOST_OTG_HS_HCDMA9 OTG_HS host channel-9 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA9			MMIO32(OTG_FS_HOST_BASE + 0x234)
/** OTG_FS_HOST_OTG_HS_HCDMASG9 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG9			MMIO32(OTG_FS_HOST_BASE + 0x234)
/** OTG_FS_HOST_OTG_HS_HCCHAR10 OTG_HS host channel-10 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR10			MMIO32(OTG_FS_HOST_BASE + 0x300)
/** OTG_FS_HOST_OTG_HS_HCSPLT10 OTG_HS host channel-10 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT10			MMIO32(OTG_FS_HOST_BASE + 0x304)
/** OTG_FS_HOST_OTG_HS_HCINT10 OTG_HS host channel-10 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT10			MMIO32(OTG_FS_HOST_BASE + 0x308)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10 OTG_HS host channel-10 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10			MMIO32(OTG_FS_HOST_BASE + 0x30c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ10 OTG_HS host channel-10 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ10			MMIO32(OTG_FS_HOST_BASE + 0x310)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG10 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG10			MMIO32(OTG_FS_HOST_BASE + 0x310)
/** OTG_FS_HOST_OTG_HS_HCDMA10 OTG_HS host channel-10 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA10			MMIO32(OTG_FS_HOST_BASE + 0x314)
/** OTG_FS_HOST_OTG_HS_HCDMASG10 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG10			MMIO32(OTG_FS_HOST_BASE + 0x314)
/** OTG_FS_HOST_OTG_HS_HCCHAR11 OTG_HS host channel-11 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR11			MMIO32(OTG_FS_HOST_BASE + 0x320)
/** OTG_FS_HOST_OTG_HS_HCSPLT11 OTG_HS host channel-11 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT11			MMIO32(OTG_FS_HOST_BASE + 0x324)
/** OTG_FS_HOST_OTG_HS_HCINT11 OTG_HS host channel-11 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT11			MMIO32(OTG_FS_HOST_BASE + 0x328)
/** OTG_FS_HOST_OTG_HS_HCINTMSK11 OTG_HS host channel-11 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK11			MMIO32(OTG_FS_HOST_BASE + 0x32c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ11 OTG_HS host channel-11 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ11			MMIO32(OTG_FS_HOST_BASE + 0x330)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG11 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG11			MMIO32(OTG_FS_HOST_BASE + 0x330)
/** OTG_FS_HOST_OTG_HS_HCDMA11 OTG_HS host channel-11 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA11			MMIO32(OTG_FS_HOST_BASE + 0x334)
/** OTG_FS_HOST_OTG_HS_HCDMASG11 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG11			MMIO32(OTG_FS_HOST_BASE + 0x334)
/** OTG_FS_HOST_OTG_HS_HCCHAR12 OTG_HS host channel-12 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR12			MMIO32(OTG_FS_HOST_BASE + 0x340)
/** OTG_FS_HOST_OTG_HS_HCSPLT12 OTG_HS host channel-12 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT12			MMIO32(OTG_FS_HOST_BASE + 0x344)
/** OTG_FS_HOST_OTG_HS_HCINT12 OTG_HS host channel-12 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT12			MMIO32(OTG_FS_HOST_BASE + 0x348)
/** OTG_FS_HOST_OTG_HS_HCINTMSK12 OTG_HS host channel-12 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK12			MMIO32(OTG_FS_HOST_BASE + 0x34c)
/** OTG_FS_HOST_OTG_HS_HCTSIZ12 OTG_HS host channel-12 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ12			MMIO32(OTG_FS_HOST_BASE + 0x350)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG12 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG12			MMIO32(OTG_FS_HOST_BASE + 0x350)
/** OTG_FS_HOST_OTG_HS_HCDMA12 OTG_HS host channel-12 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA12			MMIO32(OTG_FS_HOST_BASE + 0x354)
/** OTG_FS_HOST_OTG_HS_HCDMASG12 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG12			MMIO32(OTG_FS_HOST_BASE + 0x354)
/** OTG_FS_HOST_OTG_HS_HCCHAR13 OTG_HS host channel-13 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR13			MMIO32(OTG_FS_HOST_BASE + 0x360)
/** OTG_FS_HOST_OTG_HS_HCSPLT13 OTG_HS host channel-13 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT13			MMIO32(OTG_FS_HOST_BASE + 0x364)
/** OTG_FS_HOST_OTG_HS_HCINT13 OTG_HS host channel-13 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT13			MMIO32(OTG_FS_HOST_BASE + 0x368)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13 OTG_HS host channel-13 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13			MMIO32(OTG_FS_HOST_BASE + 0x36c)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG13 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG13			MMIO32(OTG_FS_HOST_BASE + 0x370)
/** OTG_FS_HOST_OTG_HS_HCTSIZ13 OTG_HS host channel-13 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ13			MMIO32(OTG_FS_HOST_BASE + 0x370)
/** OTG_FS_HOST_OTG_HS_HCDMA13 OTG_HS host channel-13 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA13			MMIO32(OTG_FS_HOST_BASE + 0x374)
/** OTG_FS_HOST_OTG_HS_HCDMASG13 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG13			MMIO32(OTG_FS_HOST_BASE + 0x374)
/** OTG_FS_HOST_OTG_HS_HCCHAR14 OTG_HS host channel-14 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR14			MMIO32(OTG_FS_HOST_BASE + 0x380)
/** OTG_FS_HOST_OTG_HS_HCINT14 OTG_HS host channel-14 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT14			MMIO32(OTG_FS_HOST_BASE + 0x388)
/** OTG_FS_HOST_OTG_HS_HCSPLT14 OTG_HS host channel-14 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT14			MMIO32(OTG_FS_HOST_BASE + 0x38c)
/** OTG_FS_HOST_OTG_HS_HCINTMSK14 OTG_HS host channel-14 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK14			MMIO32(OTG_FS_HOST_BASE + 0x38c)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG14 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG14			MMIO32(OTG_FS_HOST_BASE + 0x390)
/** OTG_FS_HOST_OTG_HS_HCTSIZ14 OTG_HS host channel-14 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ14			MMIO32(OTG_FS_HOST_BASE + 0x390)
/** OTG_FS_HOST_OTG_HS_HCDMA14 OTG_HS host channel-14 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA14			MMIO32(OTG_FS_HOST_BASE + 0x394)
/** OTG_FS_HOST_OTG_HS_HCDMASG14 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG14			MMIO32(OTG_FS_HOST_BASE + 0x394)
/** OTG_FS_HOST_OTG_HS_HCCHAR15 OTG_HS host channel-15 characteristics register **/
#define OTG_FS_HOST_OTG_HS_HCCHAR15			MMIO32(OTG_FS_HOST_BASE + 0x3a0)
/** OTG_FS_HOST_OTG_HS_HCSPLT15 OTG_HS host channel-15 split control register **/
#define OTG_FS_HOST_OTG_HS_HCSPLT15			MMIO32(OTG_FS_HOST_BASE + 0x3a4)
/** OTG_FS_HOST_OTG_HS_HCINT15 OTG_HS host channel-15 interrupt register **/
#define OTG_FS_HOST_OTG_HS_HCINT15			MMIO32(OTG_FS_HOST_BASE + 0x3a8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK15 OTG_HS host channel-15 interrupt mask register **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK15			MMIO32(OTG_FS_HOST_BASE + 0x3ac)
/** OTG_FS_HOST_OTG_HS_HCTSIZSG15 OTG host channel x transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG15			MMIO32(OTG_FS_HOST_BASE + 0x3b0)
/** OTG_FS_HOST_OTG_HS_HCTSIZ15 OTG_HS host channel-15 transfer size register **/
#define OTG_FS_HOST_OTG_HS_HCTSIZ15			MMIO32(OTG_FS_HOST_BASE + 0x3b0)
/** OTG_FS_HOST_OTG_HS_HCDMA15 OTG_HS host channel-15 DMA address register **/
#define OTG_FS_HOST_OTG_HS_HCDMA15			MMIO32(OTG_FS_HOST_BASE + 0x3b4)
/** OTG_FS_HOST_OTG_HS_HCDMASG15 OTG host channel x DMA address in scatter/gather DMA register **/
#define OTG_FS_HOST_OTG_HS_HCDMASG15			MMIO32(OTG_FS_HOST_BASE + 0x3b4)

/**@}*/


/** @defgroup otg_fs_host_otg_hs_hcfg OTGHSHCFG OTG_HS host configuration register
@{*/

