grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
#define OTG_FS_HOST_OTG_HS_HCSPLT0_HUBADDR_SHIFT		7
#define OTG_FS_HOST_OTG_HS_HCSPLT0_HUBADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt0_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT0_PRTADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCSPLT0_PRTADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt0_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcint0 OTGHSHCINT0 OTG_HS host channel-11 interrupt register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINT0_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_HS_HCINT0_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINT0_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_HS_HCINT0_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINT0_BBERR Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINT0_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINT0_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINT0_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINT0_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT0_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINT0_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT0_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINT0_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT0_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINT0_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT0_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINT0_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINT0_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINT0_CHH Channel halted **/
#define OTG_FS_HOST_OTG_HS_HCINT0_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINT0_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_HS_HCINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcintmsk0 OTGHSHCINTMSK0 OTG_HS host channel-11 interrupt mask register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINTMSK0_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINTMSK0_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK0_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsiz0 OTGHSHCTSIZ0 OTG_HS host channel-11 transfer size register
@{*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ0_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZ0_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsiz0_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ0_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_HS_HCTSIZ0_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_hs_hctsiz0_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ0_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZ0_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_hs_hctsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsizsg0 OTGHSHCTSIZSG0 OTG host channel x transfer size register
@{*/

/** OTG_FS_HOST_OTG_HS_HCTSIZSG0_DOPNG Do ping **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG0_DOPNG		(1 << 31)

#define OTG_FS_HOST_OTG_HS_HCTSIZSG0_PID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZSG0_PID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsizsg0_pid PID PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG0_NTD_SHIFT		8
#define OTG_FS_HOST_OTG_HS_HCTSIZSG0_NTD_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg0_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG0_SCHED_INFO_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZSG0_SCHED_INFO_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg0_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdma0 OTGHSHCDMA0 OTG_HS host channel-0 DMA address register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMA0_DMAADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCDMA0_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_host_otg_hs_hcdma0_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdmasg0 OTGHSHCDMASG0 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMASG0_DMASG_SHIFT		3
#define OTG_FS_HOST_OTG_HS_HCDMASG0_DMASG_MASK		0x1fffffff
/** @defgroup otg_fs_host_otg_hs_hcdmasg0_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcchar1 OTGHSHCCHAR1 OTG_HS host channel-1 characteristics register
@{*/

/** OTG_FS_HOST_OTG_HS_HCCHAR1_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR1_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCCHAR1_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR1_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_HS_HCCHAR1_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_HS_HCCHAR1_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_HS_HCCHAR1_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_HS_HCCHAR1_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcchar1_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR1_MC_SHIFT		20
#define OTG_FS_HOST_OTG_HS_HCCHAR1_MC_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar1_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR1_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_HS_HCCHAR1_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar1_eptyp EPTYP Endpoint type
@{*/
/**@}*/

