grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
/** OTG_FS_HOST_OTG_HS_HCCHAR1_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_HS_HCCHAR1_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_HS_HCCHAR1_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_HS_HCCHAR1_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_HS_HCCHAR1_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_HS_HCCHAR1_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_hs_hcchar1_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR1_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCCHAR1_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_hs_hcchar1_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcsplt1 OTGHSHCSPLT1 OTG_HS host channel-1 split control register
@{*/

/** OTG_FS_HOST_OTG_HS_HCSPLT1_SPLITEN Split enable **/
#define OTG_FS_HOST_OTG_HS_HCSPLT1_SPLITEN		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCSPLT1_COMPLSPLT Do complete split **/
#define OTG_FS_HOST_OTG_HS_HCSPLT1_COMPLSPLT		(1 << 16)

#define OTG_FS_HOST_OTG_HS_HCSPLT1_XACTPOS_SHIFT		14
#define OTG_FS_HOST_OTG_HS_HCSPLT1_XACTPOS_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcsplt1_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT1_HUBADDR_SHIFT		7
#define OTG_FS_HOST_OTG_HS_HCSPLT1_HUBADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt1_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT1_PRTADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCSPLT1_PRTADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt1_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcint1 OTGHSHCINT1 OTG_HS host channel-1 interrupt register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINT1_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_HS_HCINT1_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINT1_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_HS_HCINT1_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINT1_BBERR Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINT1_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINT1_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINT1_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINT1_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT1_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINT1_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT1_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINT1_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT1_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINT1_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT1_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINT1_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINT1_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINT1_CHH Channel halted **/
#define OTG_FS_HOST_OTG_HS_HCINT1_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINT1_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_HS_HCINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcintmsk1 OTGHSHCINTMSK1 OTG_HS host channel-1 interrupt mask register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINTMSK1_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINTMSK1_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK1_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsiz1 OTGHSHCTSIZ1 OTG_HS host channel-1 transfer size register
@{*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ1_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZ1_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsiz1_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ1_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_HS_HCTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_hs_hctsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_hs_hctsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsizsg1 OTGHSHCTSIZSG1 OTG host channel x transfer size register
@{*/

/** OTG_FS_HOST_OTG_HS_HCTSIZSG1_DOPNG Do ping **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG1_DOPNG		(1 << 31)

#define OTG_FS_HOST_OTG_HS_HCTSIZSG1_PID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZSG1_PID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsizsg1_pid PID PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG1_NTD_SHIFT		8
#define OTG_FS_HOST_OTG_HS_HCTSIZSG1_NTD_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg1_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG1_SCHED_INFO_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZSG1_SCHED_INFO_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg1_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdma1 OTGHSHCDMA1 OTG_HS host channel-1 DMA address register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMA1_DMAADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCDMA1_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_host_otg_hs_hcdma1_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdmasg1 OTGHSHCDMASG1 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMASG1_DMASG_SHIFT		3
#define OTG_FS_HOST_OTG_HS_HCDMASG1_DMASG_MASK		0x1fffffff
/** @defgroup otg_fs_host_otg_hs_hcdmasg1_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

