grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
/** @defgroup otg_fs_host_otg_hs_hcchar2 OTGHSHCCHAR2 OTG_HS host channel-2 characteristics register
@{*/

/** OTG_FS_HOST_OTG_HS_HCCHAR2_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR2_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCCHAR2_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR2_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_HS_HCCHAR2_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_HS_HCCHAR2_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_HS_HCCHAR2_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_HS_HCCHAR2_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcchar2_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR2_MC_SHIFT		20
#define OTG_FS_HOST_OTG_HS_HCCHAR2_MC_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar2_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR2_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_HS_HCCHAR2_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar2_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_HS_HCCHAR2_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_HS_HCCHAR2_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_HS_HCCHAR2_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_HS_HCCHAR2_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_HS_HCCHAR2_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_HS_HCCHAR2_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_hs_hcchar2_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR2_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCCHAR2_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_hs_hcchar2_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcsplt2 OTGHSHCSPLT2 OTG_HS host channel-2 split control register
@{*/

/** OTG_FS_HOST_OTG_HS_HCSPLT2_SPLITEN Split enable **/
#define OTG_FS_HOST_OTG_HS_HCSPLT2_SPLITEN		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCSPLT2_COMPLSPLT Do complete split **/
#define OTG_FS_HOST_OTG_HS_HCSPLT2_COMPLSPLT		(1 << 16)

#define OTG_FS_HOST_OTG_HS_HCSPLT2_XACTPOS_SHIFT		14
#define OTG_FS_HOST_OTG_HS_HCSPLT2_XACTPOS_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcsplt2_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT2_HUBADDR_SHIFT		7
#define OTG_FS_HOST_OTG_HS_HCSPLT2_HUBADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt2_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT2_PRTADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCSPLT2_PRTADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt2_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcint2 OTGHSHCINT2 OTG_HS host channel-2 interrupt register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINT2_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_HS_HCINT2_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINT2_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_HS_HCINT2_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINT2_BBERR Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINT2_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINT2_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINT2_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINT2_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT2_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINT2_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT2_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINT2_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT2_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINT2_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT2_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINT2_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINT2_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINT2_CHH Channel halted **/
#define OTG_FS_HOST_OTG_HS_HCINT2_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINT2_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_HS_HCINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcintmsk2 OTGHSHCINTMSK2 OTG_HS host channel-2 interrupt mask register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINTMSK2_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINTMSK2_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK2_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsiz2 OTGHSHCTSIZ2 OTG_HS host channel-2 transfer size register
@{*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ2_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZ2_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsiz2_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ2_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_HS_HCTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_hs_hctsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_hs_hctsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsizsg2 OTGHSHCTSIZSG2 OTG host channel x transfer size register
@{*/

