grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
#define OTG_FS_HOST_OTG_HS_HCTSIZ5_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_HS_HCTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_hs_hctsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ5_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_hs_hctsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsizsg5 OTGHSHCTSIZSG5 OTG host channel x transfer size register
@{*/

/** OTG_FS_HOST_OTG_HS_HCTSIZSG5_DOPNG Do ping **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG5_DOPNG		(1 << 31)

#define OTG_FS_HOST_OTG_HS_HCTSIZSG5_PID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZSG5_PID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsizsg5_pid PID PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG5_NTD_SHIFT		8
#define OTG_FS_HOST_OTG_HS_HCTSIZSG5_NTD_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg5_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG5_SCHED_INFO_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZSG5_SCHED_INFO_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg5_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdma5 OTGHSHCDMA5 OTG_HS host channel-5 DMA address register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMA5_DMAADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCDMA5_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_host_otg_hs_hcdma5_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdmasg5 OTGHSHCDMASG5 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMASG5_DMASG_SHIFT		3
#define OTG_FS_HOST_OTG_HS_HCDMASG5_DMASG_MASK		0x1fffffff
/** @defgroup otg_fs_host_otg_hs_hcdmasg5_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcchar6 OTGHSHCCHAR6 OTG_HS host channel-6 characteristics register
@{*/

/** OTG_FS_HOST_OTG_HS_HCCHAR6_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR6_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCCHAR6_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR6_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_HS_HCCHAR6_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_HS_HCCHAR6_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_HS_HCCHAR6_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_HS_HCCHAR6_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcchar6_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR6_MC_SHIFT		20
#define OTG_FS_HOST_OTG_HS_HCCHAR6_MC_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar6_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR6_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_HS_HCCHAR6_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_HS_HCCHAR6_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_HS_HCCHAR6_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_HS_HCCHAR6_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_HS_HCCHAR6_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_HS_HCCHAR6_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_HS_HCCHAR6_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_hs_hcchar6_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR6_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCCHAR6_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_hs_hcchar6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcsplt6 OTGHSHCSPLT6 OTG_HS host channel-6 split control register
@{*/

/** OTG_FS_HOST_OTG_HS_HCSPLT6_SPLITEN Split enable **/
#define OTG_FS_HOST_OTG_HS_HCSPLT6_SPLITEN		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCSPLT6_COMPLSPLT Do complete split **/
#define OTG_FS_HOST_OTG_HS_HCSPLT6_COMPLSPLT		(1 << 16)

#define OTG_FS_HOST_OTG_HS_HCSPLT6_XACTPOS_SHIFT		14
#define OTG_FS_HOST_OTG_HS_HCSPLT6_XACTPOS_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcsplt6_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT6_HUBADDR_SHIFT		7
#define OTG_FS_HOST_OTG_HS_HCSPLT6_HUBADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt6_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT6_PRTADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCSPLT6_PRTADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt6_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcint6 OTGHSHCINT6 OTG_HS host channel-6 interrupt register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINT6_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_HS_HCINT6_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINT6_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_HS_HCINT6_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINT6_BBERR Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINT6_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINT6_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINT6_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINT6_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT6_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINT6_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT6_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINT6_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT6_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINT6_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT6_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINT6_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINT6_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINT6_CHH Channel halted **/
#define OTG_FS_HOST_OTG_HS_HCINT6_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINT6_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_HS_HCINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcintmsk6 OTGHSHCINTMSK6 OTG_HS host channel-6 interrupt mask register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINTMSK6_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINTMSK6_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK6_XFRCM		(1 << 0)

/**@}*/

