grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
#define OTG_FS_HOST_OTG_HS_HCTSIZ8_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZ8_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsiz8_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ8_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_HS_HCTSIZ8_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_hs_hctsiz8_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ8_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZ8_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_hs_hctsiz8_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsizsg8 OTGHSHCTSIZSG8 OTG host channel x transfer size register
@{*/

/** OTG_FS_HOST_OTG_HS_HCTSIZSG8_DOPNG Do ping **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG8_DOPNG		(1 << 31)

#define OTG_FS_HOST_OTG_HS_HCTSIZSG8_PID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZSG8_PID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsizsg8_pid PID PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG8_NTD_SHIFT		8
#define OTG_FS_HOST_OTG_HS_HCTSIZSG8_NTD_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg8_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG8_SCHED_INFO_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZSG8_SCHED_INFO_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg8_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdma8 OTGHSHCDMA8 OTG_HS host channel-8 DMA address register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMA8_DMAADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCDMA8_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_host_otg_hs_hcdma8_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdmasg8 OTGHSHCDMASG8 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMASG8_DMASG_SHIFT		3
#define OTG_FS_HOST_OTG_HS_HCDMASG8_DMASG_MASK		0x1fffffff
/** @defgroup otg_fs_host_otg_hs_hcdmasg8_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcchar9 OTGHSHCCHAR9 OTG_HS host channel-9 characteristics register
@{*/

/** OTG_FS_HOST_OTG_HS_HCCHAR9_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR9_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCCHAR9_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR9_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_HS_HCCHAR9_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_HS_HCCHAR9_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_HS_HCCHAR9_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_HS_HCCHAR9_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcchar9_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR9_MC_SHIFT		20
#define OTG_FS_HOST_OTG_HS_HCCHAR9_MC_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar9_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR9_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_HS_HCCHAR9_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar9_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_HS_HCCHAR9_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_HS_HCCHAR9_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_HS_HCCHAR9_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_HS_HCCHAR9_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_HS_HCCHAR9_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_HS_HCCHAR9_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_hs_hcchar9_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR9_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCCHAR9_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_hs_hcchar9_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcsplt9 OTGHSHCSPLT9 OTG_HS host channel-9 split control register
@{*/

/** OTG_FS_HOST_OTG_HS_HCSPLT9_SPLITEN Split enable **/
#define OTG_FS_HOST_OTG_HS_HCSPLT9_SPLITEN		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCSPLT9_COMPLSPLT Do complete split **/
#define OTG_FS_HOST_OTG_HS_HCSPLT9_COMPLSPLT		(1 << 16)

#define OTG_FS_HOST_OTG_HS_HCSPLT9_XACTPOS_SHIFT		14
#define OTG_FS_HOST_OTG_HS_HCSPLT9_XACTPOS_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcsplt9_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT9_HUBADDR_SHIFT		7
#define OTG_FS_HOST_OTG_HS_HCSPLT9_HUBADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt9_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT9_PRTADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCSPLT9_PRTADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt9_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcint9 OTGHSHCINT9 OTG_HS host channel-9 interrupt register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINT9_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_HS_HCINT9_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINT9_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_HS_HCINT9_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINT9_BBERR Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINT9_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINT9_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINT9_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINT9_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT9_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINT9_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT9_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINT9_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT9_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINT9_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT9_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINT9_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINT9_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINT9_CHH Channel halted **/
#define OTG_FS_HOST_OTG_HS_HCINT9_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINT9_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_HS_HCINT9_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcintmsk9 OTGHSHCINTMSK9 OTG_HS host channel-9 interrupt mask register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINTMSK9_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINTMSK9_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK9_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsiz9 OTGHSHCTSIZ9 OTG_HS host channel-9 transfer size register
@{*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ9_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZ9_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsiz9_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ9_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_HS_HCTSIZ9_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_hs_hctsiz9_pktcnt PKTCNT Packet count
@{*/
/**@}*/


