grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
#define OTG_FS_HOST_OTG_HS_HCTSIZ9_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZ9_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_hs_hctsiz9_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsizsg9 OTGHSHCTSIZSG9 OTG host channel x transfer size register
@{*/

/** OTG_FS_HOST_OTG_HS_HCTSIZSG9_DOPNG Do ping **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG9_DOPNG		(1 << 31)

#define OTG_FS_HOST_OTG_HS_HCTSIZSG9_PID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZSG9_PID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsizsg9_pid PID PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG9_NTD_SHIFT		8
#define OTG_FS_HOST_OTG_HS_HCTSIZSG9_NTD_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg9_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG9_SCHED_INFO_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZSG9_SCHED_INFO_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg9_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdma9 OTGHSHCDMA9 OTG_HS host channel-9 DMA address register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMA9_DMAADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCDMA9_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_host_otg_hs_hcdma9_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdmasg9 OTGHSHCDMASG9 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMASG9_DMASG_SHIFT		3
#define OTG_FS_HOST_OTG_HS_HCDMASG9_DMASG_MASK		0x1fffffff
/** @defgroup otg_fs_host_otg_hs_hcdmasg9_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcchar10 OTGHSHCCHAR10 OTG_HS host channel-10 characteristics register
@{*/

/** OTG_FS_HOST_OTG_HS_HCCHAR10_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR10_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCCHAR10_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR10_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_HS_HCCHAR10_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_HS_HCCHAR10_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_HS_HCCHAR10_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_HS_HCCHAR10_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcchar10_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR10_MC_SHIFT		20
#define OTG_FS_HOST_OTG_HS_HCCHAR10_MC_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar10_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR10_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_HS_HCCHAR10_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar10_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_HS_HCCHAR10_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_HS_HCCHAR10_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_HS_HCCHAR10_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_HS_HCCHAR10_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_HS_HCCHAR10_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_HS_HCCHAR10_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_hs_hcchar10_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR10_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCCHAR10_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_hs_hcchar10_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcsplt10 OTGHSHCSPLT10 OTG_HS host channel-10 split control register
@{*/

/** OTG_FS_HOST_OTG_HS_HCSPLT10_SPLITEN Split enable **/
#define OTG_FS_HOST_OTG_HS_HCSPLT10_SPLITEN		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCSPLT10_COMPLSPLT Do complete split **/
#define OTG_FS_HOST_OTG_HS_HCSPLT10_COMPLSPLT		(1 << 16)

#define OTG_FS_HOST_OTG_HS_HCSPLT10_XACTPOS_SHIFT		14
#define OTG_FS_HOST_OTG_HS_HCSPLT10_XACTPOS_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcsplt10_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT10_HUBADDR_SHIFT		7
#define OTG_FS_HOST_OTG_HS_HCSPLT10_HUBADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt10_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT10_PRTADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCSPLT10_PRTADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt10_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcint10 OTGHSHCINT10 OTG_HS host channel-10 interrupt register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINT10_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_HS_HCINT10_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINT10_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_HS_HCINT10_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINT10_BBERR Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINT10_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINT10_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINT10_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINT10_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT10_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINT10_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT10_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINT10_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT10_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINT10_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT10_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINT10_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINT10_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINT10_CHH Channel halted **/
#define OTG_FS_HOST_OTG_HS_HCINT10_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINT10_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_HS_HCINT10_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcintmsk10 OTGHSHCINTMSK10 OTG_HS host channel-10 interrupt mask register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINTMSK10_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINTMSK10_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK10_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsiz10 OTGHSHCTSIZ10 OTG_HS host channel-10 transfer size register
@{*/


