grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_host.h
#define OTG_FS_HOST_OTG_HS_HCTSIZ12_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_HS_HCTSIZ12_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_hs_hctsiz12_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZ12_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZ12_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_hs_hctsiz12_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hctsizsg12 OTGHSHCTSIZSG12 OTG host channel x transfer size register
@{*/

/** OTG_FS_HOST_OTG_HS_HCTSIZSG12_DOPNG Do ping **/
#define OTG_FS_HOST_OTG_HS_HCTSIZSG12_DOPNG		(1 << 31)

#define OTG_FS_HOST_OTG_HS_HCTSIZSG12_PID_SHIFT		29
#define OTG_FS_HOST_OTG_HS_HCTSIZSG12_PID_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hctsizsg12_pid PID PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG12_NTD_SHIFT		8
#define OTG_FS_HOST_OTG_HS_HCTSIZSG12_NTD_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg12_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCTSIZSG12_SCHED_INFO_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCTSIZSG12_SCHED_INFO_MASK		0xff
/** @defgroup otg_fs_host_otg_hs_hctsizsg12_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdma12 OTGHSHCDMA12 OTG_HS host channel-12 DMA address register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMA12_DMAADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCDMA12_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_host_otg_hs_hcdma12_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcdmasg12 OTGHSHCDMASG12 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_FS_HOST_OTG_HS_HCDMASG12_DMASG_SHIFT		3
#define OTG_FS_HOST_OTG_HS_HCDMASG12_DMASG_MASK		0x1fffffff
/** @defgroup otg_fs_host_otg_hs_hcdmasg12_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcchar13 OTGHSHCCHAR13 OTG_HS host channel-13 characteristics register
@{*/

/** OTG_FS_HOST_OTG_HS_HCCHAR13_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR13_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCCHAR13_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_HS_HCCHAR13_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_HS_HCCHAR13_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_HS_HCCHAR13_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_HS_HCCHAR13_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_HS_HCCHAR13_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcchar13_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR13_MC_SHIFT		20
#define OTG_FS_HOST_OTG_HS_HCCHAR13_MC_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar13_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR13_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_HS_HCCHAR13_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcchar13_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_HS_HCCHAR13_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_HS_HCCHAR13_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_HS_HCCHAR13_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_HS_HCCHAR13_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_HS_HCCHAR13_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_HS_HCCHAR13_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_hs_hcchar13_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCCHAR13_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCCHAR13_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_hs_hcchar13_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcsplt13 OTGHSHCSPLT13 OTG_HS host channel-13 split control register
@{*/

/** OTG_FS_HOST_OTG_HS_HCSPLT13_SPLITEN Split enable **/
#define OTG_FS_HOST_OTG_HS_HCSPLT13_SPLITEN		(1 << 31)
/** OTG_FS_HOST_OTG_HS_HCSPLT13_COMPLSPLT Do complete split **/
#define OTG_FS_HOST_OTG_HS_HCSPLT13_COMPLSPLT		(1 << 16)

#define OTG_FS_HOST_OTG_HS_HCSPLT13_XACTPOS_SHIFT		14
#define OTG_FS_HOST_OTG_HS_HCSPLT13_XACTPOS_MASK		0x03
/** @defgroup otg_fs_host_otg_hs_hcsplt13_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT13_HUBADDR_SHIFT		7
#define OTG_FS_HOST_OTG_HS_HCSPLT13_HUBADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt13_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_HS_HCSPLT13_PRTADDR_SHIFT		0
#define OTG_FS_HOST_OTG_HS_HCSPLT13_PRTADDR_MASK		0x7f
/** @defgroup otg_fs_host_otg_hs_hcsplt13_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcint13 OTGHSHCINT13 OTG_HS host channel-13 interrupt register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINT13_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_HS_HCINT13_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINT13_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_HS_HCINT13_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINT13_BBERR Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINT13_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINT13_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINT13_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINT13_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT13_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINT13_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT13_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINT13_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT13_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINT13_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINT13_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINT13_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINT13_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINT13_CHH Channel halted **/
#define OTG_FS_HOST_OTG_HS_HCINT13_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINT13_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_HS_HCINT13_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_hs_hcintmsk13 OTGHSHCINTMSK13 OTG_HS host channel-13 interrupt mask register
@{*/

/** OTG_FS_HOST_OTG_HS_HCINTMSK13_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_BBERRM Babble error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_TXERRM Transaction error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_NYET Response received interrupt **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_STALLM STALLM response received interrupt mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_AHBERR AHB error **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_AHBERR		(1 << 2)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_HS_HCINTMSK13_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_HS_HCINTMSK13_XFRCM		(1 << 0)

/**@}*/

